function [ AK ] = AK_solving( Q0,Q0_K )
%UNTITLED2 此处显示有关此函数的摘要
%   此处显示详细说明
	AK(1,1) = Q0(1) - Q0_K(1);  AK(1,2) = -Q0(2) + Q0_K(2);   AK(1,3) = -Q0(3) +Q0_K(3);   AK(1,4) = -Q0(4) + Q0_K(4);
	AK(2,1) = Q0(2) - Q0_K(2);  AK(2,2) = Q0(1) - Q0_K(1);    AK(2,3) = -Q0(4) - Q0_K(4); AK(2,4) = Q0(3) + Q0_K(3);
	AK(3,1) = Q0(3) - Q0_K(3);   AK(3,2) = Q0(4) + Q0_K(4);   AK(3,3) = Q0(1) - Q0_K(1);  AK(3,4) = -Q0(2) - Q0_K(2);
	AK(4,1) = Q0(4) - Q0_K(4);   AK(4,2) = -Q0(3) - Q0_K(3);  AK(4,3) = Q0(2) + Q0_K(2);  AK(4,4) = Q0(1) - Q0_K(1);

end

